In [3]:
listem =['A','B','C','D','E']
kelime = 'ABCDE'

In [16]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
for a in kelime:
    print(a)

A
B
C
D
E

In [7]:
for a in listem:
    print(a)

A
B
C
D
E

In [8]:
sepet = []
for a in kelime:
    sepet.append(a)

In [9]:
sepet

['A', 'B', 'C', 'D', 'E']

** List Comprehension

In [23]:
[a*2 for a in kelime]

['AA', 'BB', 'CC', 'DD', 'EE']

In [40]:
df = pd.read_csv("TelcoCustomerUpShort.csv", delimiter=";")
df.head()

,gender,SeniorCitizen,tenure,PhoneService,Contract,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,Female,0,1,No,Month-to-month,Electronic check,30,30,No
1,Male,0,34,Yes,One year,Mailed check,57,1890,No
2,Male,0,2,Yes,Month-to-month,Mailed check,54,108,Yes
3,Male,0,45,No,One year,Bank transfer (automatic),42,1841,No
4,Female,0,2,Yes,Month-to-month,Electronic check,71,152,Yes

In [41]:
df.columns

Index(['gender', 'SeniorCitizen', 'tenure', 'PhoneService', 'Contract',
       'PaymentMethod', 'MonthlyCharges', 'TotalCharges', 'Churn'],
      dtype='object')

In [42]:
[col.title() for col in df.columns]

['Gender',
 'Seniorcitizen',
 'Tenure',
 'Phoneservice',
 'Contract',
 'Paymentmethod',
 'Monthlycharges',
 'Totalcharges',
 'Churn']

In [43]:
df.columns = [col.upper() for col in df.columns]

In [44]:
df.head()

,GENDER,SENIORCITIZEN,TENURE,PHONESERVICE,CONTRACT,PAYMENTMETHOD,MONTHLYCHARGES,TOTALCHARGES,CHURN
0,Female,0,1,No,Month-to-month,Electronic check,30,30,No
1,Male,0,34,Yes,One year,Mailed check,57,1890,No
2,Male,0,2,Yes,Month-to-month,Mailed check,54,108,Yes
3,Male,0,45,No,One year,Bank transfer (automatic),42,1841,No
4,Female,0,2,Yes,Month-to-month,Electronic check,71,152,Yes

In [48]:
["O_"+col for col in df.columns if df[col].dtype == "O"]

['O_GENDER', 'O_PHONESERVICE', 'O_CONTRACT', 'O_PAYMENTMETHOD', 'O_CHURN']

In [49]:
kategorik_kolonlar = ["O_"+col for col in df.columns if df[col].dtype == "O"]

In [52]:
col_num = [col for col in df.columns if df[col].dtype != "O"]
col_ob = [col for col in df.columns if df[col].dtype == "O"]

In [53]:
df[col_num]

      SENIORCITIZEN  TENURE  MONTHLYCHARGES  TOTALCHARGES
0                 0       1              30            30
1                 0      34              57          1890
2                 0       2              54           108
3                 0      45              42          1841
4                 0       2              71           152
...             ...     ...             ...           ...
7038              0      24              85          1991
7039              0      72             103          7363
7040              0      11              30           346
7041              1       4              74           307
7042              0      66             106          6845

[7043 rows x 4 columns]

In [54]:
df[col_ob]

      GENDER PHONESERVICE        CONTRACT              PAYMENTMETHOD CHURN
0     Female           No  Month-to-month           Electronic check    No
1       Male          Yes        One year               Mailed check    No
2       Male          Yes  Month-to-month               Mailed check   Yes
3       Male           No        One year  Bank transfer (automatic)    No
4     Female          Yes  Month-to-month           Electronic check   Yes
...      ...          ...             ...                        ...   ...
7038    Male          Yes        One year               Mailed check    No
7039  Female          Yes        One year    Credit card (automatic)    No
7040  Female           No  Month-to-month           Electronic check    No
7041    Male          Yes  Month-to-month               Mailed check   Yes
7042    Male          Yes        Two year  Bank transfer (automatic)    No

[7043 rows x 5 columns]

# Lambda

In [55]:
df.head()

,GENDER,SENIORCITIZEN,TENURE,PHONESERVICE,CONTRACT,PAYMENTMETHOD,MONTHLYCHARGES,TOTALCHARGES,CHURN
0,Female,0,1,No,Month-to-month,Electronic check,30,30,No
1,Male,0,34,Yes,One year,Mailed check,57,1890,No
2,Male,0,2,Yes,Month-to-month,Mailed check,54,108,Yes
3,Male,0,45,No,One year,Bank transfer (automatic),42,1841,No
4,Female,0,2,Yes,Month-to-month,Electronic check,71,152,Yes

In [56]:
df.groupby("GENDER").agg({"MONTHLYCHARGES":"mean"})

        MONTHLYCHARGES
GENDER
Female       65.223911
Male         64.350492

In [59]:
df.groupby("GENDER").agg({"MONTHLYCHARGES":lambda x: x.mean()})

        MONTHLYCHARGES
GENDER
Female       65.223911
Male         64.350492

In [60]:
df.groupby("GENDER").agg({"MONTHLYCHARGES":lambda x: round(x.mean(),2)})

        MONTHLYCHARGES
GENDER
Female           65.22
Male             64.35

In [61]:
df.head()

,GENDER,SENIORCITIZEN,TENURE,PHONESERVICE,CONTRACT,PAYMENTMETHOD,MONTHLYCHARGES,TOTALCHARGES,CHURN
0,Female,0,1,No,Month-to-month,Electronic check,30,30,No
1,Male,0,34,Yes,One year,Mailed check,57,1890,No
2,Male,0,2,Yes,Month-to-month,Mailed check,54,108,Yes
3,Male,0,45,No,One year,Bank transfer (automatic),42,1841,No
4,Female,0,2,Yes,Month-to-month,Electronic check,71,152,Yes

In [64]:
df[["MONTHLYCHARGES"]].apply(lambda row: row.sum() , axis = 0)

MONTHLYCHARGES    456267
dtype: int64